---
kind: type
id: T:Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs
source: html/e2dcca36-38d1-8bc9-d9f5-fd52bbd5ba0f.htm
---
# Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs

The event arguments used by the FamilyLoadingInto event.

## Syntax (C#)
```csharp
public class FamilyLoadingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
```